/* 
    1.什么是网络
        网络是一个共享/传输信息的虚拟平台
    2.什么是网络协议?
        每天有大量的数据在网络上传输,都需要遵循响应的规则,规则就是网络协议
    3.什么是Http协议?
        http(hypertext transfer protocol)即超文本传输协议,传输超文本内容(文字/图片/视频/音频/动漫...)
        http协议规定了数据在服务器与浏览器之间传输的格式和过程.

    4. http协议规定的细节
        http协议是一种请求应答形式的协议,一次请求对应一次应答(响应);
        细节:
            定义了浏览器以什么格式想服务器发送请求
            定义了服务器以什么格式解析浏览器发送过来的数据
            定义了服务器以什么格式响应数据给浏览器
            定义了浏览器以什么格式解析服务器响应的数据
    5.软件开发模式
        1)单机软件
            打开电脑就能使用,不需要网络,如:Hbuilder.word等
        2)C/S软件
            客户端Client /服务端Server
            需要下载安装以后,才能连接网络使用.如:迅雷/QQ等
        3)B/S软件
            浏览器Brower/服务端Server
            打开网址就能直接使用,不需要安装,如:百度/淘宝/支付宝等
    
    浏览器向服务器发送请求-----请求头/请求体
    服务器向浏览器给出响应-----响应头/响应体

    

*/